; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 386377 2 2 4 4 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	image3 - mode
	infrared2 - mode
	image1 - mode
	spectrograph0 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 image1)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 spectrograph0)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon5)
	(supports instrument2 infrared2)
	(supports instrument2 image3)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 spectrograph0)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
)
(:goal (and
	(pointing satellite0 Star8)
	(pointing satellite1 Star4)
	(have_image Star4 spectrograph0)
	(have_image Phenomenon5 image3)
	(have_image Phenomenon6 image1)
	(have_image Planet7 spectrograph0)
	(have_image Star8 spectrograph0)
))

)

; plan
1. (turn_to satellite1 star4 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star4)
   goals met: 1 of 7
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 7
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 7
4. (turn_to satellite0 groundstation2 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 groundstation2)
   goals met: 1 of 7
5. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 1 of 7
6. (turn_to satellite1 groundstation3 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 7
7. (turn_to satellite0 star8 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star8)
   goals met: 1 of 7
8. (calibrate satellite1 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 1 of 7
9. (take_image satellite0 star8 instrument1 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 2 of 7
10. (turn_to satellite1 star4 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star4)
   goals met: 3 of 7
11. (turn_to satellite0 star4 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star4)
   goals met: 2 of 7
12. (turn_to satellite1 phenomenon6 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon6)
   goals met: 1 of 7
13. (take_image satellite0 star4 instrument1 spectrograph0)
   added: (have_image star4 spectrograph0)
   goals met: 2 of 7
14. (take_image satellite1 phenomenon6 instrument2 image1)
   added: (have_image phenomenon6 image1)
   goals met: 3 of 7
15. (turn_to satellite1 star4 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 star4)
   goals met: 4 of 7
16. (turn_to satellite0 star8 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star8)
   goals met: 5 of 7
17. (turn_to satellite0 planet7 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet7)
   goals met: 4 of 7
18. (turn_to satellite1 phenomenon5 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon5)
   goals met: 3 of 7
19. (take_image satellite0 planet7 instrument1 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 4 of 7
20. (take_image satellite1 phenomenon5 instrument2 image3)
   added: (have_image phenomenon5 image3)
   goals met: 5 of 7
21. (turn_to satellite0 star8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star8)
   goals met: 6 of 7
22. (turn_to satellite1 star4 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 star4)
   goals met: 7 of 7
